[
    {
        "id": 1,
        "title": "Full Stack Software Engineer 2",
        "company": "Cohere Health, Inc.",
        "location": "Remote",
        "date": "March 2024 - Present",
        "icon": "Cohere",
        "descriptions": [
            {
                "id": 1,
                "work": "Revamped the notification system by migrating from a scheduled job to an event-driven architecture using Kafka; introduced a dynamic, decision tree-based notification type selection (payer-agnostic), reducing operational costs by 95%"
            },
            {
                "id": 2,
                "work": "Engineered a multi-tenancy architecture enabling multiple tenants to share a single schema, optimizing resource usage and simplifying maintenance."
            },
            {
                "id": 3,
                "work": "Accelerated client onboarding by developing configuration-driven solutions, significantly reducing setup time for new customers in the portal."
            },
            {
                "id": 4,
                "work": "Designed and implemented an appeal workflow for authorization requests on the portal; built a configurable UI that dynamically renders required/optional fields based on payer-agnostic rules."
            }
            ,
            {
                "id": 5,
                "work": "Reduced backend load and improved performance by minimizing redundant payer configuration queries using React Context for frontend state management."
            }
            ,
            {
                "id": 6,
                "work": "Enhanced transactional reliability by preventing unintended transaction flushing in the database, significantly reducing transactional errors in the system."
            }
            ,
            {
                "id": 7,
                "work": "Led release operations as Release Captain, ensuring timely, stable, and well-coordinated roll outs for new features and projects."
            }
            ,
            {
                "id": 8,
                "work": "Authored and evaluated multiple architectural designs, analyzing trade-offs to guide strategic technical decisions and future-proof implementations."
            }
        ]
    },
    {
        "id": 2,
        "title": "Full Stack Software Engineer",
        "company": "Cohere Health, Inc.",
        "location": "Remote",
        "date": "Jan 2022 - March 2024",
        "icon": "Cohere",
        "descriptions": [
            {
                "id": 1,
                "work": "Build a service request manual review workflow for patients when they receive medical care and stay overnight (inpatient stay)."
            },
            {
                "id": 2,
                "work": "Led claims data surface project that facilitates 50% of Durable Medical Equipment services."
            },
            {
                "id": 3,
                "work": "Guided Co-op/intern by providing knowledge of the product and solving blocks to streamline their success in the tech world."
            },
            {
                "id": 4,
                "work": "Guided Co-op/intern by providing knowledge of products and solving blocks to streamline their success in the tech world."
            }
            ,
            {
                "id": 5,
                "work": "Active participation in grooming, tasking, and tech discussion. Actively led code refactors, engaged in tech preventative care, solved slow queries, and resolved prod issues."
            }
            ,
            {
                "id": 6,
                "work": "Worked on prior authorization request automation and system to auto-approve it."
            }
            ,
            {
                "id": 7,
                "work": "Worked on the queue management system to optimize & calculate work done per hour by users."
            }
            ,
            {
                "id": 8,
                "work": "Provided pdf rendering capabilities, search, zoom in, zoom out, and rotate capabilities to the system."
            }
            ,
            {
                "id": 9,
                "work": "Tracked data of in-app users eg. clicks, and user searches keywords to provide data for product analysis."
            }
            ,
            {
                "id": 10,
                "work": "Identified and resolved bug of sending duplicate faxes to clients reduced the extra cost of 1800$ per month."
            }
            ,
            {
                "id": 11,
                "work": "Built a system to log manual attempts of agents of outreach to product users."
            }
            ,
            {
                "id": 12,
                "work": "Added Giphy gifs to the product and used them as appreciation symbol at the end of workflow to users."
            }
            ,
            {
                "id": 13,
                "work": "Created backend API's on Micronaut and Grails Platform and leveraged the Spock framework for API testing."
            }
            ,
            {
                "id": 14,
                "work": "Moved from default to custom health checkpoint of the application for availability status information."
            }
        ]
    },
    {
        "id": 3,
        "title": "Graduate Teaching Assistant",
        "company": "Illinois Institute of Technology",
        "location": "Chicago, Illinois/USA",
        "date": "September 2020 - Present",
        "icon": "Illnois Tech",
        "descriptions": [
            {
                "id": 1,
                "work": "Graded assignments, proctored exams and managed slides for Introduction to Algorithms 430 coursework."
            },
            {
                "id": 2,
                "work": "Taught algorithms and cleared doubts in recitation classroom to 40 + students."
            }
        ]
    },
    {
        "id": 3,
        "title": "Software Engineer",
        "company": "Metacube Software Pvt Ltd",
        "location": "Jaipur, Rajasthan/India",
        "date": "December 2018 - November 2020",
        "icon": "Metacube",
        "descriptions": [
            {
                "id": 1,
                "work": "Experienced Technologies: Java, JavaScript, TypeScript, Spring, AngularJS, Hibernate, SQL, Bootstrap."
            },
            {
                "id": 2,
                "work": "Developed a university applicant enrollment system to facilitate 40,000 + users every year."
            },
            {
                "id": 3,
                "work": "Integrated Jasper Server and Java Web Application to generate reports using TIBCO Jaspersoft tool minimized report creation time from 16 hours to 2 hours."
            },
            {
                "id": 4,
                "work": "Reduced hard paper work requirement of client universities to 60% by creating online documents management system."
            },
            {
                "id": 5,
                "work": "Built a system allows admin to create registration forms for university programs to enroll 10,000 plus eligible students in courses for upcoming semesters."
            },
            {
                "id": 6,
                "work": "Migrated data from clients old PHP application to new centralized application university using Async tasks."
            },
            {
                "id": 7,
                "work": "Aided company in cost-cutting by removing dependency of system from google authentication services and shifted application authentication to spring security."
            },
            {
                "id": 8,
                "work": "Collaborated in 20 people team to develop web application eases performance review of employees based on set metrics in organization quarterly, half yearly or yearly."
            },
            {
                "id": 9,
                "work": "Designed backend data filters for pagination to work on all entities on basis of 30 + common attribute."
            }
        ]
    },
    {
        "id": 5,
        "title": "Trainee",
        "company": "BSNL Telecom Factory",
        "location": "Jaipur, Rajasthan (India)",
        "icon": "BSNL",
        "date": "June 2017 - July 2017",
        "descriptions": [
            {
                "id": 1,
                "work": "Learned about Telecommunication Networks, Fiber-Optics, Communication Technologies, Mobile Communication, Broadband Technologies, and Intelligent Networks."
            }
        ]
    },
    {
        "id": 6,
        "title": "Trainee",
        "company": "The National Institute of Information Technology (NIIT)",
        "location": "Jaipur, Rajasthan (India)",
        "icon": "NIIT",
        "date": "July 2016 - July 2016",
        "descriptions": [
            {
                "id": 1,
                "work": "Learned about Telecommunication Networks, Fiber-Optics, Communication Technologies, Mobile Communication, Broadband Technologies, and Intelligent Networks."
            }
        ]
    }

]